app/views/urls/_showurl.html.erb

SELECT COUNT(*) FROM "visits" WHERE "visits"."url_id" = $1  [["url_id", 1]]
---

    <p>This has been viewed <%= "#{@url.visits.count}" %> times.</p>