app/controllers/urls_controller.rb

INSERT INTO "urls" ("created_at", "original_url", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @url = Url.new(url_params)
    # :user_id => current_user.id
    # @url.user_id = current_user.id
    if @url.save