app/controllers/visits_controller.rb

  def show
    @url = Url.find(params[:id])
    Visit.create(:url_id => params[:id])
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT 1  [["id", "15"]]
INSERT INTO "visits" ("created_at", "updated_at", "url_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 08 Nov 2013 21:25:45 UTC +00:00], ["updated_at", Fri, 08 Nov 2013 21:25:45 UTC +00:00], ["url_id", 15]]